Study2/src/DataProcessors/ЗагрузкаДокументов/ЗагрузкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДокументов</name>
</mdclass:DataProcessor>

Study2/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>EnumRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/DataProcessors/ЗагрузкаДокументов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаПродолжить", ЭтотОбъект,"ПутьКФайлу");
	
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "Файл с таблицей данных (.dat)| *.dat";
	ДиалогВыбора.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаПродолжить (Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
		ЭтотОбъект[ДополнительныеПараметры] = Результат[0];
		ЗагрузитьФайл(ЭтотОбъект[ДополнительныеПараметры]);
	КонецЕсли;
	
КонецПроцедуры                                             

&НаСервере
Процедура ЗагрузитьФайл(ПутьФайла)
	
	ДеревоДокумента = ЗначениеИзФайла(ПутьФайла);
	Если ТипЗнч(ДеревоДокумента) <> Тип("ДеревоЗначений") Тогда
		Сообщить("Выберите другой файл");
		Возврат
	КонецЕсли;
	Для каждого Строка Из ДеревоДокумента.Строки Цикл
		Пров = Ложь;
		СсылкаДокумент = XMLЗначение(Тип("ДокументСсылка.УстановкаЦенНоменклатуры"), Строка.Ссылка);
		
		Если ЗначениеЗаполнено(СсылкаДокумент.Номер) Тогда
			ОбъектДокумент = СсылкаДокумент.ПолучитьОбъект();
			
			Если ОбъектДокумент.Проведен Тогда
				Пров = Истина; 
				НЗ=РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
				НЗ.Отбор.Регистратор.Установить(СсылкаДокумент);
				НЗ.Записать();
			КонецЕсли;
			
		Иначе
			ОбъектДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			ОбъектДокумент.УстановитьСсылкуНового(СсылкаДокумент);
		КонецЕсли;
		
		ОбъектДокумент.Филиал = XMLЗначение(Тип("СправочникСсылка.Филиалы"), Строка.Филиал);
		ОбъектДокумент.Основание = XMLЗначение(Тип("ДокументСсылка.ПриходнаяНакладная"), Строка.Основание);
		ОбъектДокумент.ВидЦены = Перечисления.ВидыЦен[Строка.ВидЦены];
		ОбъектДокумент.Дата = ТекущаяДата();
		ОбъектДокумент.Состав.Очистить();
		ОбъектДокумент.Записать(); 
		
		Для Каждого Строка2 Из Строка.строки Цикл
			ОбъектДокумент = СсылкаДокумент.ПолучитьОбъект();
			ТабЧастьДокумента = ОбъектДокумент.Состав.Добавить();
			ТабЧастьДокумента.Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Строка2.Номенклатура);
			ТабЧастьДокумента.Цена = Строка2.Цена;
			ОбъектДокумент.Записать();
			
			Если Пров Тогда
				ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПриОткрытииНаСервере();
	Счетчик = Счетчик + ТЗ.Количество();
	
	
КонецПроцедуры
		
&НаСервере
Процедура ЗаполнениеТаблицы(ОбъектДокумент)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ТЗ.Очистить(); 
	
	ДокументыВыборка = Документы.УстановкаЦенНоменклатуры.Выбрать();
	Пока ДокументыВыборка.Следующий() Цикл
		СтрокиТЗ = ТЗ.Добавить();	
		СтрокиТЗ.Ссылка = ДокументыВыборка.Ссылка;
		СтрокиТЗ.Проведен =  ДокументыВыборка.Проведен;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиНаСервере()
	
	ИндексСтрок = Элементы.ТЗ.ВыделенныеСтроки;
	
	Для Каждого Индекс ИЗ ИндексСтрок Цикл
		
		Если Индекс >= ТЗ.Количество() Тогда
			Индекс = Индекс - Счетчик;
		КонецЕсли;
		
		Строка = ТЗ.Получить(Индекс);
		ОбъектДокумент = Строка.Ссылка.получитьОбъект(); 
		
		Если  Не ОбъектДокумент.Проведен Тогда
			ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла; 
	Счетчик = Счетчик + ТЗ.Количество();
	
	//Честно списано у Насти :(
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры
	
&НаКлиенте
Процедура Провести(Команда)
	ПровестиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеНаСервере()
	
	ИндексСтрок = Элементы.ТЗ.ВыделенныеСтроки;
	
	Для Каждого Индекс ИЗ ИндексСтрок Цикл 
		
		Если Индекс >= ТЗ.Количество() Тогда
			Индекс = Индекс - Счетчик;
		КонецЕсли;
		
		Строка = ТЗ.Получить(Индекс);
		ОбъектДокумент = Строка.Ссылка.получитьОбъект();
		
		Если ОбъектДокумент.Проведен Тогда
			ОбъектДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЦикла;                  
	
	Счетчик = Счетчик + ТЗ.Количество();
    ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	ОтменитьПроведениеНаСервере();
КонецПроцедуры
